//
//  Comments.swift
//  Weather
//
//  Created by 한상진 on 10/17/23.
//

import Foundation

/**
 1. info.plist도 폴더 안에 들어가 있으면 일관성이 있을듯 하네용
 2. RxSwift가 현존하는 강한 의존성이라 익히기 위해 사용하시는건 좋은데요
    2-1. 명령형/선언형 프로그래밍의 차이부터 시작해서, 디버깅할 때 좋은점 나쁜점, 내부적으로 돌아가는 로직, Single은 어떻게 사용하는지, Stream은 어떻게 유지하고 관리하는지 등등 깊게 아셔야 할 것 같아요. (아니면 면접에서 털려요 ㅠ)
    2-2. Rx는 의존성이 강한 프레임워크라 앱 뿌리부터 Rx를 사용하게 되면 앞으로 Rx를 걷어낼 때 많이 힘들거에요. 따라서 Rx를 써본 뒤에 걷어내보고 그 과정에서 느낀점을 면접에서 말하는것도 좋을듯
 3. 폴더 구조가 조금 flat하다고 느껴져요. 계층 구조를 나눠서 폴더링해도 ㄱㅊ을거 같아여
 4. 런치스크린은 굳이 따지자면 리소스가 맞을거 같아여
 5. 전반적으로 크게 잘못된 점은 없어보이긴 하는데, 클린아키를 사용하고, Rx로 되어있어서 코드 점핑이 많아지고, 시그니처가 불분명한 부분들이 조금 있는거 같아요.
 틀렸다는건 아니고 고런 아이들을 씀으로써 얻을 수 있는 장단점에 대해 명확하게 말 할 수 있으면 좋을듯
 */
